Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/btzbsys.h
/*
 * Component description for BTZBSYS
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2024-05-07T20:51:46Z */
#ifndef _WBZ65_BTZBSYS_COMPONENT_H_
#define _WBZ65_BTZBSYS_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR BTZBSYS                                      */
/* ************************************************************************** */

/* -------- BTZBSYS_SUBSYS_CNTRL_REG0 : (BTZBSYS Offset: 0x00) (R/W 32) SUBSYS_CNTRL_REG0 -------- */
#define BTZBSYS_SUBSYS_CNTRL_REG0_RESETVALUE  _UINT32_(0x00)                                       /*  (BTZBSYS_SUBSYS_CNTRL_REG0) SUBSYS_CNTRL_REG0  Reset Value */

#define BTZBSYS_SUBSYS_CNTRL_REG0_zb_slp_ctrl_Pos _UINT32_(0)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG0) zb_slp_ctrl Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_zb_slp_ctrl_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_zb_slp_ctrl_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) zb_slp_ctrl Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_zb_slp_ctrl(value) (BTZBSYS_SUBSYS_CNTRL_REG0_zb_slp_ctrl_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_zb_slp_ctrl_Pos)) /* Assigment of value for zb_slp_ctrl in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_zb_soft_reset_in_Pos _UINT32_(1)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG0) zb_soft_reset_in Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_zb_soft_reset_in_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_zb_soft_reset_in_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) zb_soft_reset_in Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_zb_soft_reset_in(value) (BTZBSYS_SUBSYS_CNTRL_REG0_zb_soft_reset_in_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_zb_soft_reset_in_Pos)) /* Assigment of value for zb_soft_reset_in in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_zb_reset_by_fw_Pos _UINT32_(3)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG0) zb_reset_by_fw Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_zb_reset_by_fw_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_zb_reset_by_fw_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) zb_reset_by_fw Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_zb_reset_by_fw(value) (BTZBSYS_SUBSYS_CNTRL_REG0_zb_reset_by_fw_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_zb_reset_by_fw_Pos)) /* Assigment of value for zb_reset_by_fw in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_zb_en_main_clk_Pos _UINT32_(4)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG0) zb_en_main_clk Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_zb_en_main_clk_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_zb_en_main_clk_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) zb_en_main_clk Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_zb_en_main_clk(value) (BTZBSYS_SUBSYS_CNTRL_REG0_zb_en_main_clk_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_zb_en_main_clk_Pos)) /* Assigment of value for zb_en_main_clk in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_1_iom_en_Pos _UINT32_(5)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG0) ant_div_sel_1_iom_en Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_1_iom_en_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_1_iom_en_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) ant_div_sel_1_iom_en Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_1_iom_en(value) (BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_1_iom_en_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_1_iom_en_Pos)) /* Assigment of value for ant_div_sel_1_iom_en in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_2_iom_en_Pos _UINT32_(6)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG0) ant_div_sel_2_iom_en Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_2_iom_en_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_2_iom_en_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) ant_div_sel_2_iom_en Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_2_iom_en(value) (BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_2_iom_en_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_2_iom_en_Pos)) /* Assigment of value for ant_div_sel_2_iom_en in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_pdc_ov_Pos _UINT32_(16)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) bt_pdc_ov Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_pdc_ov_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_bt_pdc_ov_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) bt_pdc_ov Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_pdc_ov(value) (BTZBSYS_SUBSYS_CNTRL_REG0_bt_pdc_ov_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_bt_pdc_ov_Pos)) /* Assigment of value for bt_pdc_ov in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_sfr_wakeup_bit_Pos _UINT32_(17)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) bt_sfr_wakeup_bit Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_sfr_wakeup_bit_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_bt_sfr_wakeup_bit_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) bt_sfr_wakeup_bit Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_sfr_wakeup_bit(value) (BTZBSYS_SUBSYS_CNTRL_REG0_bt_sfr_wakeup_bit_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_bt_sfr_wakeup_bit_Pos)) /* Assigment of value for bt_sfr_wakeup_bit in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_hw_rc_re_cal_Pos _UINT32_(18)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) bt_hw_rc_re_cal Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_hw_rc_re_cal_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_bt_hw_rc_re_cal_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) bt_hw_rc_re_cal Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_hw_rc_re_cal(value) (BTZBSYS_SUBSYS_CNTRL_REG0_bt_hw_rc_re_cal_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_bt_hw_rc_re_cal_Pos)) /* Assigment of value for bt_hw_rc_re_cal in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_reset_by_fw_Pos _UINT32_(19)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) bt_reset_by_fw Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_reset_by_fw_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_bt_reset_by_fw_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) bt_reset_by_fw Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_reset_by_fw(value) (BTZBSYS_SUBSYS_CNTRL_REG0_bt_reset_by_fw_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_bt_reset_by_fw_Pos)) /* Assigment of value for bt_reset_by_fw in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_en_main_clk_Pos _UINT32_(20)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) bt_en_main_clk Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_en_main_clk_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_bt_en_main_clk_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) bt_en_main_clk Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_en_main_clk(value) (BTZBSYS_SUBSYS_CNTRL_REG0_bt_en_main_clk_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_bt_en_main_clk_Pos)) /* Assigment of value for bt_en_main_clk in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_subsys_dbg_bus_sel_top_Pos _UINT32_(22)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) subsys_dbg_bus_sel_top Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_subsys_dbg_bus_sel_top_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_subsys_dbg_bus_sel_top_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) subsys_dbg_bus_sel_top Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_subsys_dbg_bus_sel_top(value) (BTZBSYS_SUBSYS_CNTRL_REG0_subsys_dbg_bus_sel_top_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_subsys_dbg_bus_sel_top_Pos)) /* Assigment of value for subsys_dbg_bus_sel_top in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_aclb_soft_rst_n_Pos _UINT32_(23)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) aclb_soft_rst_n Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_aclb_soft_rst_n_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_aclb_soft_rst_n_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) aclb_soft_rst_n Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_aclb_soft_rst_n(value) (BTZBSYS_SUBSYS_CNTRL_REG0_aclb_soft_rst_n_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_aclb_soft_rst_n_Pos)) /* Assigment of value for aclb_soft_rst_n in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_aclb_pwr_rst_n_Pos _UINT32_(24)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) aclb_pwr_rst_n Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_aclb_pwr_rst_n_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_aclb_pwr_rst_n_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) aclb_pwr_rst_n Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_aclb_pwr_rst_n(value) (BTZBSYS_SUBSYS_CNTRL_REG0_aclb_pwr_rst_n_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_aclb_pwr_rst_n_Pos)) /* Assigment of value for aclb_pwr_rst_n in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_subsys_dbg_bus_sel_Pos _UINT32_(25)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) subsys_dbg_bus_sel Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_subsys_dbg_bus_sel_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_subsys_dbg_bus_sel_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) subsys_dbg_bus_sel Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_subsys_dbg_bus_sel(value) (BTZBSYS_SUBSYS_CNTRL_REG0_subsys_dbg_bus_sel_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_subsys_dbg_bus_sel_Pos)) /* Assigment of value for subsys_dbg_bus_sel in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_arb_Pos _UINT32_(26)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) disable_pclk_arb Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_arb_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_arb_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) disable_pclk_arb Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_arb(value) (BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_arb_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_arb_Pos)) /* Assigment of value for disable_pclk_arb in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_zb_mac_Pos _UINT32_(27)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) disable_pclk_zb_mac Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_zb_mac_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_zb_mac_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) disable_pclk_zb_mac Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_zb_mac(value) (BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_zb_mac_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_zb_mac_Pos)) /* Assigment of value for disable_pclk_zb_mac in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_bt_Pos _UINT32_(28)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) disable_pclk_bt Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_bt_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_bt_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) disable_pclk_bt Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_bt(value) (BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_bt_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_bt_Pos)) /* Assigment of value for disable_pclk_bt in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_ovrd_val_Pos _UINT32_(29)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) ant_div_sel_ovrd_val Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_ovrd_val_Msk (_UINT32_(0x3) << BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_ovrd_val_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) ant_div_sel_ovrd_val Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_ovrd_val(value) (BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_ovrd_val_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_ovrd_val_Pos)) /* Assigment of value for ant_div_sel_ovrd_val in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_ovrd_en_Pos _UINT32_(31)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) ant_div_sel_ovrd_en Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_ovrd_en_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_ovrd_en_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) ant_div_sel_ovrd_en Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_ovrd_en(value) (BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_ovrd_en_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_ovrd_en_Pos)) /* Assigment of value for ant_div_sel_ovrd_en in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_Msk         _UINT32_(0xFFDF007B)                                 /* (BTZBSYS_SUBSYS_CNTRL_REG0) Register Mask  */


/* -------- BTZBSYS_SUBSYS_CNTRL_REG1 : (BTZBSYS Offset: 0x04) (R/W 32) SUBSYS_CNTRL_REG1 -------- */
#define BTZBSYS_SUBSYS_CNTRL_REG1_RESETVALUE  _UINT32_(0x1800)                                     /*  (BTZBSYS_SUBSYS_CNTRL_REG1) SUBSYS_CNTRL_REG1  Reset Value */

