Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/btzbsys.h
/** \brief BTZBSYS register offsets definitions */
#define BTZBSYS_SUBSYS_CNTRL_REG0_REG_OFST _UINT32_(0x00)      /* (BTZBSYS_SUBSYS_CNTRL_REG0) SUBSYS_CNTRL_REG0 Offset */
#define BTZBSYS_SUBSYS_CNTRL_REG1_REG_OFST _UINT32_(0x04)      /* (BTZBSYS_SUBSYS_CNTRL_REG1) SUBSYS_CNTRL_REG1 Offset */
#define BTZBSYS_SUBSYS_CNTRL_REG2_REG_OFST _UINT32_(0x08)      /* (BTZBSYS_SUBSYS_CNTRL_REG2) SUBSYS_CNTRL_REG2 Offset */
#define BTZBSYS_SUBSYS_CNTRL_REG3_REG_OFST _UINT32_(0x0C)      /* (BTZBSYS_SUBSYS_CNTRL_REG3) SUBSYS_CNTRL_REG3 Offset */
#define BTZBSYS_SUBSYS_STATUS_REG0_REG_OFST _UINT32_(0x20)      /* (BTZBSYS_SUBSYS_STATUS_REG0) SUBSYS_STATUS_REG0 Offset */
#define BTZBSYS_SUBSYS_STATUS_REG1_REG_OFST _UINT32_(0x24)      /* (BTZBSYS_SUBSYS_STATUS_REG1) SUBSYS_STATUS_REG1 Offset */
#define BTZBSYS_SUBSYS_STATUS_REG2_REG_OFST _UINT32_(0x28)      /* (BTZBSYS_SUBSYS_STATUS_REG2) SUBSYS_STATUS_REG2 Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief BTZBSYS register API structure */
typedef struct
{  /*  */
  __IO  uint32_t                       BTZBSYS_SUBSYS_CNTRL_REG0; /**< Offset: 0x00 (R/W  32) SUBSYS_CNTRL_REG0 */
  __IO  uint32_t                       BTZBSYS_SUBSYS_CNTRL_REG1; /**< Offset: 0x04 (R/W  32) SUBSYS_CNTRL_REG1 */
  __IO  uint32_t                       BTZBSYS_SUBSYS_CNTRL_REG2; /**< Offset: 0x08 (R/W  32) SUBSYS_CNTRL_REG2 */
  __IO  uint32_t                       BTZBSYS_SUBSYS_CNTRL_REG3; /**< Offset: 0x0C (R/W  32) SUBSYS_CNTRL_REG3 */
  __I   uint8_t                        Reserved1[0x10];
  __I   uint32_t                       BTZBSYS_SUBSYS_STATUS_REG0; /**< Offset: 0x20 (R/   32) SUBSYS_STATUS_REG0 */
  __I   uint32_t                       BTZBSYS_SUBSYS_STATUS_REG1; /**< Offset: 0x24 (R/   32) SUBSYS_STATUS_REG1 */
  __I   uint32_t                       BTZBSYS_SUBSYS_STATUS_REG2; /**< Offset: 0x28 (R/   32) SUBSYS_STATUS_REG2 */
} btzbsys_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _WBZ65_BTZBSYS_COMPONENT_H_ */
